Revit 2027 API
EdgeArray.Item Property
Gets or sets an edge at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Edge this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Edge
	Get
	Set
public:
virtual property Edge^ Item[int index] {
	Edge^ get (int index);
	void set (int index, Edge^ value);
}
abstract Item : Edge with get, set
override Item : Edge with get, set
Parameters
index Int32
The index of the edge to be set or retrieved.
Return Value
Edge
Returns the edge at the specified index.
See Also
Reference
EdgeArray Class
Autodesk.Revit.DB Namespace